[{"領域":"電力（範例）","課程名稱":"電力電子實驗","開課教授":"陳耀銘","推薦一起修之課程名稱":"電力電子概論","課程小卦":"\n前半學期幾乎是電力電子概論實作，這就是推薦跟概論一起修的原因，會有種把理論應用、實作出來的爽感；\n後半學期則製作一台小型電扇，個人覺得很像高級美勞課（?），會學到一些焊接和電路板雕刻的技術","課程小卦2（您的修課心得）":"強烈建議實驗課的上課時段空出「至少兩個時段」，期中考之前都是基本電路，不會花太多時間，要寫結報預報。期中考之後是要做Project(看評價之前好像是做一台小型電風扇)，今年是做Flyback Converter，然後會有三個輸出(+15V\/-15V\/+5V)的電路，包括佈線、鋪銅、Protel軟體操作、變壓器繞製、雕刻機操作、電路調整blablabla，如果是手腳俐落的強者也許可以很順利，但我看這學期的修課同學幾乎都有額外找時間去做，因為只去一堂根本做不完QQ，愚蠢如我，變壓器還繞錯兩次，白白多花了兩節課的時間，到後面常常翹其他課去實驗室補做，蠻麻煩的，希望以後的修課同學能好好規劃，真的要空下至少兩個時段，以免遇到跟我一樣需要翹課做實驗的情形。Btw，大家再用Protel這套軟體的時候要小心，有時候好像會發生「沒有回應」的情況，但他沒有word自動儲存的功能，好像不只我一個人遇到所以應該不是個案，建議在使用的時候隔一段時間可以存個檔，我第一次schematic作業就是這樣造成慘劇發生= = 接到最後一個元件結果沒有回應，然後重畫來不及，又不能補交該次作業直接0分...","課程小卦3（您的修課心得）":"有問過之前修課的同學，和之前相比這學期的電路多了一個回授路徑，因此提高了佈線時的難度，本蠢花了一整個晚上佈了兩次才成功佈出來。\n另外就是最後測量用的儀器因為每個人要做一個電路的關係(前半學期會是兩人一組操作儀器)，時常要等別人做完才去用，所以也同樣建議空出多點時段。\n這門課會有期末考，這學期考的大概就是前面基本電路的波形和後半段的儀器操作、IC型號等等。","課程小卦4（您的修課心得）":null},{"領域":"電波","課程名稱":"電磁波實驗","開課教授":"林坤佑","推薦一起修之課程名稱":"電磁學二","課程小卦":"主要就是配合電磁二的教學內容（傳輸線、波導、天線） 沒有final project 但是每週都要作實驗(12個)  不過 雖然老師說會盡量配合電磁二進度 但是大部分的時間都是實驗超前電磁二 寫結報的時候如果不先自己往前讀一點的話會有點辛苦或不知道在幹麻 另外 實驗也會出現一些電磁二沒有教的東西（例如圓形波導和號角天線） 但是這部份不會太為難 期末考的部份也\"不會\"出現太可怕的東西（圓形波導的bessel function之類的） 整體而言是蠻好的實驗 修過電磁二的同學 下學期修的話應該會輕鬆一些\n期末考完全不需要背公式 考卷第二面就是所有會用到的公式了","課程小卦2（您的修課心得）":null,"課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null},{"領域":null,"課程名稱":"嵌入式實驗","開課教授":"王勝德","推薦一起修之課程名稱":null,"課程小卦":null,"課程小卦2（您的修課心得）":"拋磚引玉一下，老師教了很多東西，每周結報也都很簡單，大部份有做就OK了，Final Project越早想到題目越好，可以盡早開始構思實作。","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null},{"領域":"ICS","課程名稱":"數位電路實驗","開課教授":"簡韶逸","推薦一起修之課程名稱":"積體電路設計\n數位系統設計\n交換電路與邏輯設計","課程小卦":"簡介\n就是一片 FPGA+Verilog。會 Verilog 再來修更好，助教基本上不會教太多，整體而言都是自學（下學期助教不知道是不是同個）\n課程基本上是三個作業+一個期末專題。\n作業\n- 第一個作業不難，基本上就是熟悉 FPGA、Verilog 和 Quartus 操作。\n- 第二個作業則是練習實作簡單的演算法，了解硬體實作和 high-level 的演算法設計有哪些不同，另外還可以學到像是 RS-232 等簡單的 protocol 是如何用硬體實作。這個實驗開始就有點電機系的感覺了\n- 第三個作業就比較麻煩了，要設計一個簡單的錄音機。難的點大概是要讀很多文件吧，因爲要和音訊、LCD 等周邊模組溝通，這些模組的 spec 都要自己讀，有耐心讀的話其實也不算太難。\n另外上面幾個作業都可以實作額外功能，應該會加分（不過加分重不重要後面會提到）\n期末專題\n題目完全自訂，可以很難也可以很簡單。建議就是盡量讓所有功能都在 FPGA 上實作，往年有些組會把大部分功能在電腦上實作，那老師或助教給的評價可能就不會太好。另外題目不要訂太大，期末專題前會先有一個 proposal，助教應該會在題目訂太難前把你攔下來，以免期末發表 demo 不出東西。另外要注意的是 FPGA 和一般開發板很不同，所以題目的規模可能不太一樣，訂很大的題目前請三思\n其他建議\n1. 組員慎選，因爲這幾年都是整組同分\n2. 可以多研究（Terasic 或 Altera）範例 code，可以加減學一下 Verilog 的 coding style\n3. 不要重新發明輪子。Quartus 中有非常多 Altera 寫好的模組，可以用的時候就拿來用，一般來說比自己寫還要實際\n4. 雖然看起來 loading 有點重，不過這幾個學期給分好像都很好，至少一半有 A，所以加分好像沒那麼重要？？\n5.（暗黑）推薦 Qsys + NIOS II，有這兩個東西你也可以把數電當嵌入式修，不過要先研究一些文件就是了\n整體評價\n想走數位電路設計的話應該是必修，不然如果是想做一些更應用的題目的話，嵌入式應該是更好的選擇。\n很多人說這門課 loading 很重，我想就像前面提到的，這門課是兩個簡單的作業和一個比較難的作業，而且如果懂得利用現有資源的話三個作業其實都很簡單，當然從學習硬體設計的角度來看其實所有東西都自己寫是更能學到東西的，這就看個人取舍了。期末專題也是一樣，題目不要訂到太大我想都不至於爆肝做不完，此外也是要多利用內建的資源會更輕鬆。\n可以學到的東西大概是 Verilog、寫 testbench、看文件、簡單的架構設計、常見 protocol 實作等等，感覺還蠻電機系的一門課。\n整體還是推個，如果爆肝的話不要怪我拜託 <(_ _)>","課程小卦2（您的修課心得）":"雖然常常寫code寫到清晨6點，不過期末project做完其實滿有成就感的XD","課程小卦3（您的修課心得）":"自學請點滿，查資料也要點滿，verilog很難查，很難debug，然後助教很難找。恩.....剩下我自盡","課程小卦4（您的修課心得）":null}]