[{"課程名稱":"生醫","開課教授":"李百祺","推薦同時修習的課程":"電電實驗、生理學、沒修過生醫工程概論","推薦預先修習的課程":"電電實驗 電電實驗 電電實驗","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"107-1學期有換助教，助教雖然有些實驗講解不夠嚴謹，但人很nice也很友善!!!!!~大推!，有問題寄信問他們或當場問他們，他們都很願意幫你解答，他們不確定的地方或他們沒有注意到的地方，他們也都很樂意改正，實驗三還因此多延長幾天的deadline。實驗一：一個下午實驗結束，頂多報告再多做一下下，就基本生理信號(ECG, EMG, EEG)測量。實驗三：智慧手錶之生理訊號量測，並把它顯示在app上，但他app的扣都會給你，只要複製貼上即可，最麻煩的是要讓android studio 和code相容... 實驗三大概一天~一天半可完成。實驗二：大型電電實驗，目標是要接出2個電路，正負極和接地各夾上貼片，電路要能濾掉雜訊，連接arduino，再連接app，讓心電圖和肌電圖在app上顯示。 app 用app inventor寫，有家產就還好，沒家產還滿折磨的QQ，期末專題的部分：只要跟生醫有關，想做啥都可，要先進度報告，demo(時間點大約是期末考週前2週)，期末考後才需要交書面報告。實驗二、final很累人...其他時間就比較還好。成績甜不甜目前還不知道。","課程小卦2（您的修課心得）":"實驗一測量ECG EEG EMG這三個訊號，然後分析生理意義，建議要先查別人研究的測量方式再來做實驗，否則有些實驗描述偏向定性描述比較難做。\n\n實驗二自己設計電路濾出這三個訊號，用arduino吃這些訊號，再用AppInventor設計app接收arduino bt 模組將這三個訊號近似real time的方式呈現在手機app上。電路算是好處理的部分，arduino和AppInventor就比較尷尬（也可能是筆者太廢啦），所以最好找個會arduino的人組隊。\n\n實驗三用Z2智能手錶測量生理數據，用Android studio寫app接受生理資訊然後完成該手錶附講義內的兩項實驗，這個實驗由於是這個學期新增，所以下學期的詳細內容尚不確定。\n====（抱怨警告）====\n實驗三由於是新增的所以問題比較多，其一是手錶型號和實驗講義版本不符，實驗室的Z2手錶測量PPG的綠光LED在某些模式下是不會啟動的，而講義上的實驗要求卻需要PPG測量數據；其二是實驗講義內容品質去菁存蕪，做實驗的時候比起看實驗講義內容還不如去翻該章節的參考資料找原文論文來讀，因為實驗講義的講解是\"擷取&照抄\"參考的論文內容（某人曰：全華出版，呵呵），只是將英文翻成中文而已，而\"擷取&照抄\"造成的斷章取義的結果便是實驗講義的講解部分常常有缺漏、公式推導毫無頭緒、前後代號不統一、實驗步驟缺漏等問題，會有嚴重的理解困難與實驗困難 ，不過這部分經過這學期的反饋應該會改善（實驗講義參考網址： http:\/\/www.chwa.com.tw\/newUN\/bookinfo.asp?b_no=10461 ） ；其三是手錶測量穩定性不佳 （難怪沒過醫療器材審核），比如HRR的實驗要求我們在跑步機上跑到極限運動區(160~180bpm) 並記錄跑步機的速度，負責實驗的同學可能體力不要太好不然很難跑到極限運動區，因為在速度加快的狀況下手部運動幅度大，造成手錶測量HR十分不精準無法得到精確的HR數值，實驗失敗機率高使得實驗者要多次嘗試到達極限運動區，真的很累。\n\n期末專題部分，同左邊課程小掛1的內容，值得補充的是DEMO時教授偏好能夠有成品的專題，實體物件、App、能夠運行的程式等都行。\n\n助教部分，人很好是事實，回信頻率高，偶爾會有陳述問題聽不懂的情況，實驗二講解可以使用的濾波器電路不太清楚，實驗三設計不良沒有先確認實驗講義和手錶的問題，整體而言並沒有特別推\n\n分數部分，據說是紮實分，每次專題報告提問會加分，其餘是實驗分數，詳細評分方式可以參考生醫實驗網站\n\n小結：很明顯整學期從頭到尾就只有EEG、ECG、EMG阿，剩下的就是電路和coding，生醫實驗的生醫比重偏低，沒辦法學到其他更多的生醫知識，筆者修完一個學期也是有點失望，偏浪費時間（註：筆者成績大概是60%而已，各位大佬要修來刷GPA可能不用這麼悲觀）。","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null},{"課程名稱":"網路多媒體","開課教授":"林宗男","推薦同時修習的課程":null,"推薦預先修習的課程":null,"課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"學期中分三個小題目，沒什麼loading。期末project可能要選比較潮的題目(blockchain, 或跟ML相關)會比較吸引教授停留，組員要慎選，以避免demo開天窗或期末做到死","課程小卦2（您的修課心得）":null,"課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null},{"課程名稱":"電磁波","開課教授":"盧信嘉","推薦同時修習的課程":null,"推薦預先修習的課程":"電磁二","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"一學期總共做十一次實驗，每次實驗之前都會有預習考，考試內容都從實驗講義出（這是老師「強迫」大家讀實驗講義的方式XD），不過由於老師也有教微波系統導論，所以有些題目感覺比較像是那門課的題目，並沒有在實驗講義裡面詳細說明，這是我覺得需要改進的地方。（不過老師說他已經二十年沒有帶這門實驗了，因此很希望能聽聽同學的意見，筆者有把以上的意見反映給老師，因此筆者覺得下學期有很大機率會把預習考的題目重新翻修）。每個禮拜實驗做完都要寫實驗結報，盧老師非常認真，會認真閱讀每一組的實驗報告，並在下次實驗的時候與同學討論寫得不好的地方，讓人收穫豐富。老師也很親切，臉上總是掛著一抹微笑，也認真回答同學的問題，因此如果修完電磁一、電磁二，對於電磁學的興趣還沒有消磨殆盡（？）的話，不妨來體驗一下。筆者認真覺得這個實驗的Loading在十選二實驗裡面一定算是輕鬆的～～（補充：學期末有期末考，不過老師會給大家公式，因此只要了解概念就可以來考試了）","課程小卦2（您的修課心得）":null,"課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null}]