[{"領域":null,"課程名稱":"電路學","開課教授":"毛明華","推薦同時修習的課程":null,"推薦預先修習的課程":"無","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"教授上課要很專心聽，因為他的ppt上面只有一些各章的觀念，他在講題目的時候ppt上面是沒有算式的，所以只要一下子沒專心聽，之後就不知道他在講哪裡了。不過教授有時候也有點幽默，會講些笑話。上課唯一的規定就是不要吃東西，但也沒有說真的管很嚴。教授都不會點名。","課程小卦2（您的修課心得）":"教授平時會補充一些課本沒有但重要的概念或技巧，也會解釋為什麼要引入新的觀念，以及分析在哪些情況下適合哪些解題方式，而不是只教大家盲目刷習題卻不知其所以然。教授一開始教課本例題都是用板書，但後來為了趕進度，就把算式都列在ppt上。只是老師講話語調平緩，來上課的學生越來越少……\n今年因為書商授權的問題，所以換了新課本，只是新課本奇爛無比，觀念寫得不清不楚，特別在bode plot那章，不僅是內容雜亂無章，缺漏了許多重點，甚至有些圖還錯的很離譜。教授會把舊課本和新課本的內容都整理在ppt上，只是因為時間倉促，後面章節的部分就比較缺乏系統性，但課後花一些時間複習還是能整理出架構來。此外，老師勾選習題比較慢，但因為線上學習平台也有題目可以練習，所以沒有太大影響。整體來說，老師教得很詳細，只是上課有點無聊。","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"電路學","開課教授":"陳奕君","推薦同時修習的課程":"信號與系統\b","推薦預先修習的課程":"不需要基礎（極少成分calculus)","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"教授上課速度快，但觀念說得非常清楚，ppt也做得很好。通常認真上課，下課以後只需要練習一下題目就好了。建議不要蹺課。此外教授臉看起來可能有點臭臭的，但其實人超級nice，下課可以多問她問題ＸＤＤＤ（註：猜測教授不喜歡同學上課看著筆電）","課程小卦2（您的修課心得）":null,"課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"信號與系統","開課教授":"李琳山","推薦同時修習的課程":"電路學","推薦預先修習的課程":"微積分、線性代數","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"這一門課有點像電機系的必修集大成的感覺，很大部分是在其他課會反覆用到的數學（其實幾乎都是微分方程）和它們的延伸，再加上取樣（sampling）跟信號處理的基本觀念。不過個人覺得這個部分只有兩章，而且不是考試的重點很可惜。琳山大師會在個人教學網站放上課程錄影，另外會在期中考、期末考後分別請該次成績前十五名吃飯，俗稱「琳山宴」；不過大師的上課內容以講述觀念為主，有時未必會對考試有直接的幫助。","課程小卦2（您的修課心得）":"就算不是琳山大師的學生也可以報名參加琳山宴喔(哎呀真是抱歉哈哈~是報名信號與人生拉~琳山大師的信號與人生很值得聽，我聽完後很感動，就算不是03班的也大推來聽。另外03上課時重點會放在主題與主題之間的連結，還有他個人的體會，所以有時候對考試不是很有幫助，考試的部分要自己念(搭配課本)，這點比較花時間，所以我建議可以修別的老師的課，然後來聽信號與人生(誤","課程小卦3（您的修課心得）":"不是琳山宴吧 是信號與人生吧www","課程小卦4（您的修課心得）":"求報名琳山宴的方法@@想吃吃不到","課程小卦5（您的修課心得）":"聽說連豐力信號很棒，可以去youtube找","課程小卦6（您的修課心得）":"回左邊，聽完豐力，再上琳山的課，會有融會貫通的感覺，雖然不一定考比較好QQ","課程小卦7（您的修課心得）":"琳山大師的課一定要用聽的，只看投影片不體會教授貫通整體內含的方式。教授在每章中都會帶一些重要題目，加上做作業基本上就足夠了。只不過要注意教授在處理題目時不一定會把他所有underlying的思考都說出來，因此還是要經過自己的整理。另外一定要作筆記，因為教授的投影片是專門配合上課時用的，不適合用來作考前複習。教授對大部分章節講解都很仔細，但是建議在Laplace transform的章節裡unilateral transform和ROC的部分可以再多找一些資料。","課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"電子學（二）","開課教授":"鍾孝文","推薦同時修習的課程":null,"推薦預先修習的課程":"電子學（一）","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"教學內容：將上學期所教過的各種電晶體和積體電路分析應用於各種常用的電路元件上，和電子一不同的是，會有包含到數位電路的部分，個人覺得電子一下半學期要好好聽課，尤其積體電路那邊要特別熟，你的電子二才不會炸爛。\n\n教學風格：上課主要以板書為主，到第十七章改成用投影片，雖然教授上課常常自嘲自己的筆記不夠用，複習還是要看sedra smith，但個人覺得不需要，他的筆記到第十五章前都很夠用，但第十七章要投向sedra smith的懷抱（還有第十五章部分公式）。教學節奏掌握得非常好，不太會讓大家睡著，就算他要趕課，他也不會讓你感到資訊量過大而無法消化，最後還會提早教完，雖然沒有像呂帥那麼會標重點，而且在推導上面偏隨便，對重視數學推導過程的人來說會小頭痛，但是講課蠻清楚的，最主要還是著重在觀念。有作業，每週1~7題不等，但都是小考會考的習題所以沒差。\n\n教授個性：鍾爸人超級好，很能夠體諒學生的辛苦，他是個能夠不厭其煩地重新幫我們複習電子一的好好先生，所以對於上學期在混的人來說，鍾爸是你最棒的選擇；而且他非常親民，講起話來也相當幽默，更重要的是，他上課時分享的一些他個人的人生經歷，蠻令人感動的，而且能和學生引起非常大的共鳴，總而言之，他真的是一個很棒的教授。\n\n給分甜嗎：鍾爸班平均分數是各班之中排名第二的，比呂帥低了十分，但比其他兩班高了十分。\n\n加簽習慣：只簽20人呦。","課程小卦2（您的修課心得）":"1.可以請他喝啤酒，他很愛\n2.可以叫他模仿琳山，他很會\n3.可以請他幫你宣傳系學會會長投票，他很罩","課程小卦3（您的修課心得）":"一句話，推爆\n上學期我是呂帥班的，上課就是不斷的解題目記解法，常常上到腦袋缺氧xD\n後來這學期上鍾爸班就愛上鍾爸ㄌ，鍾爸上課比較不會像呂帥一樣注重推導和每一步的細節，而是培養對電路的「感覺」，像transfer function的pole鍾爸班的大概都是直接用看的，結果算不出來xDD\n我覺得很適合對數學很沒自信的人來修，因為鍾爸說他說他本身數學也不好，跟他超有共鳴xD而且每個禮拜派作業對於小考的loading真的比較輕，不會每次都卡到最後一個禮拜在趕工。\nㄛ對了，鍾爸是色盲ㄛ，這點我很快樂xDDDD","課程小卦4（您的修課心得）":"左邊是數學不好的卷哥嗎QQ","課程小卦5（您的修課心得）":"鍾爸的作業是每個禮拜都會出，也就是上完課就可以複習的意思，不過由於鍾爸完全不用ceiba，所以如果沒抄到作業題號就得去問同學~~","課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":"CS選修","課程名稱":"計算機概論","開課教授":"于天立","推薦同時修習的課程":null,"推薦預先修習的課程":"計算機程式","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"先講比較偏我個人想法XD，歡迎推文平衡一下~\n計算機概論以前是大一必修，現在改成選修了。這門課就結論上來說其實我覺得不到一定要修，主要原因是每個東西都帶你認識一點，但都很皮毛，跟高中的生活科技課很像的風格。\n不過也有優點，就是比較知道CS方面的每個領域在幹嘛，像一開始有講一些資料儲存、作業系統、網路的基本運作原理，後半學期講演算法跟人工智慧、計算理論比較多。\n有點像電腦科學發展史啦，就講這些東西的起源ㄚ，誰在哪年提出那些，當通識聽，而且老師上課風格很活潑，老師是真的很有熱忱的人!(套一句老師的說法就是有點GEEK啦)上完計概之後就對各個領域都有個概念，之後碰到就不會那麼陌生。\n作業也要花一些時間，雖然說主要是上課概念的實作，比如寫動態規劃，寫op code的轉換，還有期末的貪食蛇AI，上面講的都是程式作業，一學期六次，雖然可以用Python繳交，不過大部分的document跟助教給的code還是用C++，強烈建議會寫C++比較好，雖然不是說太難，但紙本作業同時來的時候真的蠻麻煩的，而且紙本作業也是花時間的那種。\n老師是個很重視學生自己寫的人，整個學期嚴禁抄襲，程式也會用特殊方法抓抄襲。老師常常講國外學校也都很重視榮譽之類，期末還留一個小時跟我們聊人生。然後我覺得這學期某個助教特雷，作業講解跟沒講差不多，給的code還常常有錯，重點是期中期末舉手問問題也可以回答錯@@\n總之我覺得這算是一門很不電機的課，可能對大神來說都懂了修了也沒必要，對一般人如我就當一些零碎的知識記起來。\n阿對，考試也算有難度，通常是7 、8題簡答，阿有些根本就考智商，像丟蛋問題阿，權重分配問題之類的。\n講一講其實好像修了也不錯?\n","課程小卦2（您的修課心得）":"這堂課我覺得六次程式+手寫作業的loading是挺重的，若對程式很懼怕的人要三思。另外期中期末可以帶A4雙面大抄(但其實用處不大xdd)","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":"必修","課程名稱":"機率與統計","開課教授":"謝宏昀","推薦同時修習的課程":"信號與系統","推薦預先修習的課程":"微積分","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"比較偏向個人想法，歡迎平衡。\n先說結論，我覺得單純透過老師上課學到東西的人，應該很少，所以如果習慣先聽老師上課有第一次印象，回去再複習的人(就像我)，就不是很推薦這門課，但如果你是本來就很厲害，看課本就可以看懂，又想聽一些補充或是老師的想法，那這門課應該就蠻適合你的\n謝宏昀最有名的就是他精美的講義還有可怕的預習作業，雖然謝宏昀班的期中期末平均一向很高，但我覺得大部分是學生自己努力的功勞，下面會解釋。\n預習作業是老師會先放上下周上課的講義，要你利用GOOGLE CLASSROOM的平台跟同學討論，然後寫當周的預習作業。聽起來好像不錯，但我個人覺得，謝宏昀的講義如果是第一次看很難全懂，不然就是很花時間，因為老師很喜歡把其中幾頁砍掉，上課再加回去，預習的時候就變成要搭配課本，然後又可能第一次看，所以就超級花時間(不過課本我覺得蠻淺顯易懂的)。\n如果你想說，預習感覺不會太花時間，那你就錯了。也有可能是我的問題啦，但宏昀幾乎每次預習作業都放期中期末考古，簡單預習也很難一下寫出來，就算寫出來了，書差不多也看完了，周末也沒了。\n當然我不否認在這種訓練下宏昀班的學生都會變強，但幾乎都是靠自己啊XDD，雖然上課老師會提醒一些該注意的地方，不過就我的觀察，蠻多數人上課都很容易分神，因為回去都唸完了上課就不知道要幹嘛XDD。\n講義有看過課本之後會覺得編得不錯，好啦我可能都在講老師壞話，想說平衡一下，大家快點嘴砲我(X。\n","課程小卦2（您的修課心得）":"我覺得謝宏昀整門課完全贏在PPT和他講話邏輯非常清晰，不過相反的選這個班真的會常常需要佔用到蠻大量的唸書時間。因為預習討論有計算在平時成績當中，會遇到有些人刷一些無意義的留言。（好啦這只是抱怨）\n\n有修過他的計算機程式的人應該就很熟悉這種模式，就是把上機作業改成寫心得+2~3題習題就是了。（當然就是因此份量相對而言增加很多）\n\n最後，非常不建議和信號與系統一起修，這一門課的共同作業份量極大而進度極亂，同時修下去期末一定會火葬場。","課程小卦3（您的修課心得）":"個人雖然是106-2時修的，但還是分享一下我的淺見，綜合而言，謝宏昀班的分數之所以會那麼高多半是靠大家自己的努力，像我個人平均一週都會花6-8小時在預習作業上，是\"只有預習作業\"喔，而且這6-8小時是無間斷無分神的那種，最慘我記得我有一整個週末都在看他的ptt，但是這樣努力下的回報除了分數以外，最重要的是，你在期中期末考前不用花太多時間複習（但有可能是我個人的因素），因為平常花在機率的時間可能是其他科總合的兩倍以上，所以這些機率的公式就很自然地記住了，但也有壞處，像是我常常直接在課堂上睡著，因為原本都預習過了，就會覺得無聊，但是他又常常在裡面塞個沒在預習作業上的slide，所以一不小心就剌掉一點東西。但是成績之高是真的很高，謝班期中期末平均比其他斑膏了少至18分多則22分，非常的誇張。","課程小卦4（您的修課心得）":"我覺得最大的好處是每個禮拜都有預習，其實真的也不用花太多時間，然後上課的時候聽老師講就可以把預習miss掉的重點撿起來，啊如果覺得無聊也可以稍微恍神一下還是不會走失，然後我個人覺得，機率很難都是在騙的，電機有一卡車必修比機率難多了，只要跟著老師的每週預習進度，考前刷一下考古題，其實算比較沒壓力的必修了","課程小卦5（您的修課心得）":"個人是105-2 修的老人，也來分享一下我的想法。\n看今年老師評價似乎負能量頗多來平衡一下。\n也算是回應第一位同學，首先，敝人電機系讀了三年，系內系外的課也都修了不少，真正主要靠上課學到東西的其實只有鍾孝文教授的電子學。（結果變成來廣告電子學（？）\n大部分的課程內容，其實都是靠自己的。教授能給你的，是知識間的脈絡（context）、直覺（intuition ）、跟另種觀點（alternative  viewpoint）。我認為系上的琳山教授跟宏昀教授的強項都在這裡，雖說宏昀教授教學方式可能沒有大師那麼有聲有色，而且大部分的時間還是聚焦在課本內容上，但是關於機率的數學基礎（Borel-sigma field、測度論等等）、比較進階的應用（queueing），這些課外有用而重要的內容也都會被老師涵蓋到。\n\n總之我修完這一學期的機率之後就決定跟老師做專題了，也花了很多時間繼續讀機率、數理統計相關的東西。我想這門課對我最大的收穫是給了我對機率的熱情。\n","課程小卦6（您的修課心得）":"個人覺得如果不是真的很愛數學，只是想修過工數的話修其他教授反而可以得到更多應用層面上的知識~~而且會有一份很大份的複習作業在寫證明，對我來說覺得有點沒必要...","課程小卦7（您的修課心得）":"我覺得今年的課程已經拿掉很多以前有講的比較難的東西了，(我有跟過去修的同學借講義來用)，我自己也是每週會花上6小時\b左右預習，佔了週末很多時間，但覺得這份量還算可接受，而且可以對課程有自己的理解方式而非被灌輸，\b期中期末也不需花太多時間讀。\n\n唯一缺點是我覺得老師把預習投影片中拿掉幾頁有點母湯，因為其實上課還是講的一樣快，而且ceiba上的有幾次也還是有缺的\b版本 ＠＠，不過這個問題只要跟過去有修過的同學借講義就可以解決了（X\n\n另外我個人覺得，就算有預習，上課還是讓我吸收到比原本講義上更多的東西，畢竟自己讀會忽略某些觀點，這學期機率真的收穫不少。\n\n\bp.s. 我覺得可以不預習直接上課就有吸收良好效果的必修課只有呂帥電子學跟和麟離散","課程小卦8（您的修課心得）":"我覺得教授每週都有給預習作業和範圍其實對於考試是蠻有幫助的，而且教授上課講的其實和預習的也沒有完全重疊，所以就算預習了還是可以去上課（？）主要是每週有固定的預習，基本上考前有不太需要重新自己唸過一遍，加上預習也沒有那麼花時間，一個禮拜最多就算五六個小時好了，但如果不是考試前的話，基本上星期天的那五六個小時基本上也不會造成什麼壓力，反而會讓考前的自己比較輕鬆一點吧","課程小卦9（您的修課心得）":null},{"領域":"必修","課程名稱":"信號與系統","開課教授":"王鈺強","推薦同時修習的課程":"電路學","推薦預先修習的課程":"有laplace的課(微積分、電路學、微分方程)\n有frequency response,bode plot之類的課 (電路學、電子學)","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"上課方式：ppt，ceiba一開始上傳的是無筆記的投影片，老師上課時會在投影片上做筆記講解，然後再把筆記檔放到ceiba上\n\n對課程的想法：信號與系統這門課其實主要就是在教transform(包含CTFT,DTFT,Laplace transform,z-transfrom)，還有filter的frequency response、信號的取樣及還原、一點點AM跟FM......，然後信號期中期末是可以帶大抄的，所以可想而知這門課就是滿滿的公式，不過我覺得這門課要學得好，圖像化思考不可少，因為很多時候用數學推倒要想很久，然後又長得很醜，但是把time domain的圖及frequncy domain的圖畫出來就會發現其實題目沒有想像中複雜，用直觀的圖形去想問題的解法，再把對應的數學式子寫出來，這樣會容易很多，所以說要背的不是數學公式，公式都在大抄上了，要記憶的應該是那些圖像。\n\n對老師的感覺：我覺得老師上課就中規中矩吧，該講的東西都會講到(block diagram也有...聽說琳山班只有一張投影片...)，因為都在投影片上，比較難的部分會放慢，如果接下來的東西會用到之前的觀念，老師也會幫我們小小複習一下，其實感覺沒有什麼特別好說的，反正就是必修課+ppt+好的教授的那種感覺，學習效果好壞大部分是在個人，老師教得再好還是需要自己念的。當初是想去加簽琳山班的，因為聽說他是信號大師，不過加簽那天教室真的是滿出來，所以只好作罷，由於沒上過琳山的課，所以在此我不好去比較兩個老師的優劣，的確鈺強沒有琳山多年的教學經驗，但是我覺得聽鈺強上課也沒有什麼不好，不會遺漏掉什麼東西，雖然我是沒問過老師問題，不過我看老師回答同學的問題都還蠻親切的，有一次補課的時候還請我們喝飲料，人很nice。我猜測很多人之所以很多人會去擠琳山班主要是因為他教了很久，而由於其他新老師沒什麼評價而不敢選，這是人之常情(誰會想要給菜鳥教呢)，但是總是需要給新老師一些機會，不然必修永遠都會是一攤死水(你說是吧)。鈺強常常在上課自嘲自己現在教的信號與當年自己上課時一樣少人，尤其禮拜一的早九，如果搭上豪雨，那台下更是悽悽慘慘悽悽，目測平常會來上課的大概二十幾個人吧，我不知道這樣的情況會不會影響到老師的心情就是了，不過感覺得出來鈺強是有在努力自己教得更好的，所以選到鈺強的學弟如果簽不到琳山不用擔心，鈺強也是不錯滴，必修這種東西喔，終究還是要自己k最實在。\n\n課程外的bouns：老師這學期有請假兩次，請假的時候都有請助教來帶考古題，對考試或多或少有些幫助，然後本學期最後一堂課老師講了一些跟ML有關的東西，由於老師本身是做電腦視覺、機器學習、AI那塊的，所以有興趣的也可以去請教老師~~~不過信號與系統這堂課碰不到這些東西就是了呵呵","課程小卦2（您的修課心得）":null,"課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":"p.s. 我覺得可以不預習直接上課就有吸收良好效果的必修課只有呂帥電子學跟和麟離散","課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"電磁學二","開課教授":"吳瑞北","推薦同時修習的課程":null,"推薦預先修習的課程":"微積分、電磁學一","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"原本是想加簽毛紹綱教授班的，不過他說只給10個人加簽，於是來到了吳瑞北教授班。\n\n瑞北教授是位對於電磁學的教學非常有熱忱的老師，也會有不少和學生的互動，不管大家對於上課內容、教學方式、考試方式或閱卷形式有任何問題，他都非常樂意幫忙解決。（例如幾乎全部加簽、開放期末考帶大抄、期中考重新個別閱卷等等，平常他也會留在教室回答將近20分鐘的問題）\n\n通常電磁學這門課最被電機系學生討厭的，就是電場、磁場這些東西過於抽象，但他上課的時候也都會輔以他請之前高雄大學的學生幫忙開發的模擬軟體，把課本上推導出來的解用動畫讓我們體會。課本上有些公式推導用了很多向量微積分的概念，但老師偶爾會有不一樣的神奇做法，不只比課本上的版本還容易操作，也更容易理解其物理意義。\n\n這個學期毛班似乎因為教授出國停課，到期末考週前兩天還在加課，但本班的進度相當健康，老師授課進度幾乎沒有比大綱慢超過兩個小時過。平常上課的時候，因為大部分人都在143或根本沒有來，教室內人算蠻少的，但教室氣氛很好，每個星期五最後也會稍微提一點不一樣的內容XD\n\n最後，這個學期他總共點了兩次名，還有偶爾挑人回答問題，不過應該都沒有算分，總而言之，大推吳瑞北教授！","課程小卦2（您的修課心得）":"個人也推吳瑞北，也大概分析一下優缺點：\n\n優點：\n    (1) 投影片編排：內容很有條理，如果因為rao的語句太長無法消化的話，瑞北講義就是把rao的重點標出來，然後用人看的懂的方法把這些內容重寫一遍，再加一些他自己的神奇推法以及實際應用，在期末看不完課本時，瑞北的講義可以幫你一把（雖然他用的符號沒有和rao統一）。\n\n    (2) 老師口條及上課氛圍：瑞北上課算講得清楚（雖然上半學期有聽過毛班，覺得還是毛的口條比較好），他比較著重在觀念的部分，推導蠻清楚的，和樓上所言他會有一些比較好理解的神奇推導，在此不贅述，上課氛圍輕鬆，講話語調不會無聊，上半學期常常點同學回答問題，而且會在同學面前開一些政治笑話，多半都很ㄎ一ㄤXDDD，是那種年輕人也會笑的那種（就他會在宣傳系學會長投票時喊征服宇宙那種）。\n\n    (3) 電腦軟體模擬：誠如樓上所言，他會把很抽象的電磁學透過模擬讓大家知道這些電場磁場如何運作，在此不贅述，除外他會分享一些他自己的專利，讓你可以更清楚學電磁的用處再哪。\n\n    (4) 傾聽民意：誠如樓上所言，他會願意幫忙解決學生在電磁這門課所發生的各種問題，在此不贅述。\n\n缺點：\n    (1) 綠到出汁：從他開政治笑話那一刻起，你就會知道他綠到你被劈腿十次都沒他綠，所以如果你覺得他的幽默不足以掩蓋他綠到發光的這個事實，你可以聽聽別班。\n\n    (2) 上課不帶例題：他的投影片和上課內容在例題方面帶的不太多，所以都要回家多練多摸索，所以如果你是希望老師能夠帶你做多一點題目的話，他不是你的首要選擇。\n\n    (3) 線上小考：嚴格說起來這是電磁學二各班共有的問題，但這問題的起因絕對是他，總而言之線上小考系統超雷，希望未來有個修過網多和Web的救救本系電磁學的網站，而這個問題你選哪個班都逃不掉，你只能怪瑞北很推這個東西。\n\n總之，還蠻推的，大家可以不用執著於加簽毛班。\n","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"電磁學二","開課教授":"毛紹綱","推薦同時修習的課程":null,"推薦預先修習的課程":"微積分、電磁學一","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"先跟大家說，我電磁很爛，所以想看大神發的請跳過我這欄xD\n教學內容&教學風格：\n說好聽點是延續電磁一的內容，但我覺得其實電磁二跟電磁一內容差蠻多的，電磁一都在算數學算物理，電磁二就比較能對應到現在或未來我們能夠接觸到的東西。其實現在考完電磁學我已經差不多忘得差不多了，不過我們班一直都是進度偏慢的，因為毛紹綱很龜毛，每次講到一個新的觀念都會進行三件事\n1.回去找以前教過的東西，跟我們說這個是跟以前有連結的\n2.找軟體模擬給我們看這是什麼東西\n3.講結論順便把1和2再重複一遍\n這樣的結果就是他每次12:10分結束的課他都12:30~40才下課，害我每次都搭不到公車(x)，甚至中間因為他出國，所以最後差點教不完，期末考前一個禮拜的禮拜六還多加了兩個小時的課才剛好教完。雖然如此，我覺得他還是一個很棒的老師，至少他這樣不斷重複對我來說還蠻能加深印象的，上學期電磁一說實話我大概整個學期只聽得懂半堂課(對，就是開學第一個禮拜講課程大綱的那半堂)，可是這學期我大部分上課的東西都是有聽懂的，而且對電磁學的負面印象真的有矯正很多xD\n教授個性：\n是個好老師，很在乎學生到底有沒有聽懂他說的話，他每次都看著我們說：你們的眼神看起來好茫然，這樣我會擔心你們沒聽懂我剛剛教的欸，然後他又重複上述的123(冗)。如果你喜歡這種不斷重複的上課方式、或是你跟我一樣笨自己讀都讀不懂的話推薦來修毛紹綱的課，保證完全了解電磁二在幹嘛然後電磁一還是啥都不會。\n額外提醒：\n毛紹綱班是唯一有辦自己小考的班級！不過因為沒考很難，也就像先準備一下期末考而已。分數的部分我記得期中跟北北班差不多，所以可以各取所好\n加簽習慣：\n只簽10個ㄛ，所以才會有這麼多人跑去北北班簽，然後發現北北也很好xDDD\n最後，雖然毛紹綱很話癆，我還是大推！","課程小卦2（您的修課心得）":"我是前半學期修李翔傑班後半學期跳槽到毛紹綱班的，毛班上課的步調明顯比李班慢了不少，但是進度其實並沒有差到很多(李班在期末考前的禮拜六其實也有補課)，可能是因為我對電磁學吸收理解的速度比較慢，上翔傑的課時常常會感覺還來不及搞懂這張投影片在幹嘛，就跳到下一張投影片了，所以上完一堂課下來就會覺得自己好像懂了一些，但其實還是有很多不懂的地方，後來到了毛班因為老師會一再反覆強調，課堂中間也會留不少喘息時間，然後又常常讓我們用物理直觀的方式搭配圖像、影像去理解電磁學的觀念，所以上完課之後能夠吸收的東西我個人是覺得比李班還要多很多。\n\n補充：我們這屆的電磁二可以感受到毛紹綱帶著其他教授想改變一些東西，像是小考改成用iEMPT線上考試(以前應該不是這樣考吧，我不確定...)，然後因為期中大家考太差而讓我們期末考可以帶大抄(能帶大抄超棒的，我真的不懂背一堆公式有什麼意義，能查到的東西幹嘛背)，然後教授也不斷反覆強調他希望我們期末考能考好，能感受到他希望我們能夠在電磁學的課堂上學到有用的東西，而不只是單純的教課然後就過去了的感覺(就是電磁一的那種感覺)\n\n小卦：不過這學期的大助教風格非常...強硬?閱卷方式跟任何其他課都不同，首先是要回信才能閱卷，然後閱卷也不是所有人同時一起閱，而是分批不同時段閱卷，期中考的時候是一次兩位，期末考的時候好像是一次五位。期中閱卷的時候沒有可以要分的助教在場，必須把你覺得批改有問題的地方寫在一張白紙上，然後之後大助教就會寄信回覆你，簡單來說就是變得非常非常難要分，也幾乎沒有轉圜的餘地，於是乎就有人跟教授抱怨了這樣的作法，所以之後我們在某次下課時間又閱了一次卷= =。期末考的時候大助教稍微放寬了他的做法，這次是有可以要分的助教在場，但是可以感受得到現場氣氛十分壓抑，大助教買了飲料來問其他助教要不要喝，竟然沒有助教敢應聲，然後我嘗試著去要分小助教看起來也都一臉哀怨的樣子，一點分數都不想給，所以說...大助教真的很恐怖呀!!!\n(雖然在這邊批評助教應該沒啥用，不過就想吐吐苦水)","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"電子學（二）","開課教授":"呂良鴻","推薦同時修習的課程":null,"推薦預先修習的課程":"電路學、電子學（一）","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"呂帥的好，大家都知道（？）不過畢竟是最大班，常常都會有大量的正反評價XD\n選這個班的優點，第一個自然是期中考海放了其他班超過10分。\n呂帥的投影片整理得非常完整，脈絡相當清晰，這點也在他的講課過程中有了很好的展現。通常他的上課方式是會先將電路畫出來，代入一些數字讓大家對電路有基本的感覺，接下來才開始用代號講解電路的作用。 \n電子一的時候，呂帥大部份時候都會教大家要假設node電壓、寫branch電流、解聯立方程式，電子二當然也繼承了這個模式。不過在一些較複雜的放大器電路，他還是會教大家利用一些常見的放大器公式求解。如果你是一個對於一開始就看到一大堆的代號會感到有些微不適的，這一班會是你非常好的選擇。 \n但是這一班是在143上課，人多，教室內常常會很悶（尤其是冬、春時節），授課方式也很像補習班，通常沒什麼題外話，並且比較重視基礎解電路的部分，非常適合考試，但就難免讓人覺得沒那麼模組化（這個詞應該是這樣用的嗎）。 \n另外，電子學二的其他班是要交作業的（佔學期成績5%），但是呂帥說不用交，直接平均分配到小考成績裡面。（畢竟小考就是考有勾的那些習題） \n電子學二的老師聽說都很不錯，就看各位覺得自己比較適合哪一種教學類型的囉！","課程小卦2（您的修課心得）":"推樓上超詳細~補充一下呂帥是做IC相關研究的，所以上課會多補充一些IC的製程。另外就是要記得自己念書，因為呂帥不收作業，上課又講得很清楚，如果平常不練習，等到小考或期中期末會挫賽","課程小卦3（您的修課心得）":"電子二的範圍本質上和電子一後半部一樣有很多近似出來的結果，如果比較喜歡追求原理推導，老師上課的時候雖然會提，但不會有時間慢慢寫出來，還是需要自己平常\/考前花時間想。前半部範圍很吃電子一第7章的觀念，所以如果電子一停修這裡會比較吃虧，之後幾乎所有transfer function都是很大一串，所以要考試當場從KVL, KCL推極度花時間，所以需要盡可能去記講義上pole, zero, time constant的近似表示法(考前務必要推一次)，如果真的考推導也可以快速驗證。習題的部分不用交，但是如果上課沒有太認真聽可以先抄完解答再慢慢想是怎麼寫的，對小考稍微變化一下或期中期末都有幫助。","課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"電路學","開課教授":"陳信樹","推薦同時修習的課程":null,"推薦預先修習的課程":null,"課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"先說，這篇極度負能量，希望有人能來平衡個。換了一本連出版商都沒有發解答的課本真D有夠可笑，算了一堆題目結果沒有人有答案，到後面幾乎整個系都在看曜明的題目跟詳解過活。至於教授的上課風格非常非常非常的緩慢，而且很好睡，我在第二次小考後就再也聽不下去沒去上課自讀，我身邊也有不少人沒去上課，有的自讀有的就換到曜明班拿講義聽課，總之不推他，尤其是他那個精美的PPT，真的不忍心看超過10分鐘。電路學不難，考的不是你懂不懂會不會電路，就是來逞罰容易粗心的人，很無趣的一門課，基本上就是刷提刷提當模考題再刷，就可以拿高分了。","課程小卦2（您的修課心得）":"課本沒有解答真的太智障了啦!而且還有一些電壓源莫名其妙印成轉向的，然後就像前一個說的真的非常好睡，我大概聽到第一次小考結束之後就改投曜銘了，不過其實電路學應該是一個可以自學的科目，換個方式想，說不定他以此訓練我們呢!","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":null,"課程名稱":"電磁學二","開課教授":"李翔傑","推薦同時修習的課程":null,"推薦預先修習的課程":"電磁學一","課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":"老師很年輕，很重視學生對於他上課方式的建議或看法，個性也很和善。問的問題都會認真看待，有時候會有他不清楚的問題，他會跟你說他要回家想清楚，因為他不希望還沒想清楚就告訴你，害你有錯誤的理解。上課是一般的投影片，內容大部分是課本的圖片與文字，但會有老師自己加的補充說明，以及和課程內容有關的應用。我特別喜歡的是如果有用到前面章節的公式或內容，他都會有recap註解在投影片旁邊(這點我覺得老師很細心，需要recap的地方幾乎沒有遺漏)。老師上課口齒清晰，架構清楚，所以不需要因為老師年紀輕而擔心他教的不好喔 ! 給分部分因為是系上必修，所以應該和其他班是一樣的，沒有甚麼特殊的加分或扣分機制。加簽的部分我猜應該是都會簽，來聽他的課的人很少，幾乎都跑去毛班了。最後，如果大家喜歡小班上課，或是想要有很多和老師直接互動的機會，真心推薦李翔傑老師的電磁學二，請大家多支持年輕的老師 !","課程小卦2（您的修課心得）":null,"課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null},{"領域":"必修","課程名稱":"機率與統計","開課教授":"葉丙成","推薦同時修習的課程":null,"推薦預先修習的課程":null,"課程小卦1（團體討論、老師教學風格、給分甜嗎？是紮實分？老師個性？加簽習慣？嚴禁遲到...等）":null,"課程小卦2（您的修課心得）":"耶又到了批判翻轉教育的時間啦，老師身為翻轉教育的大力推手，我只能說，我完全沒有感受到翻轉教育到底好在哪裡。第一堂課老師跟我們說翻轉的精神就是：「在家裡學習，在課堂寫作業」，學生能自行掌握自己的進度，而在學校老師就負責驗收學生的學習成果，並幫助解決學生的疑難，影片教學的好處就是能夠節省很多時間，因為在課堂上老師常常會同一句話重複講的好幾遍，所以一堂五十分鐘的課如果錄成影片的話往往不到三十分鐘，說得好像很有道理，但是...現實好像有點差距。\n\n首先，根本就不是「在家裡學習，在課堂寫作業」，而是「在家寫作業，在課堂繼續寫更多作業」，每周除了有影片進度之外，還有檢驗題要做，做完題目後請同學批改(這些批改的同學都是自願的，因為可以加分)然後在社團回報進度，來到課堂，老師又會丟給我們in-class challenge，然後整整三個小時幾乎都在做題目，我就不懂那我為什麼要來課堂，這種東西在家做不是就好了，尤其是有詳解這種東西存在。\n\n好啦在課堂上不是完全都在寫題目，老師在大家題目都做得差不多後，會請同學上台解題，然後小組就可以加分，可是問題是，抽籤系統超不公平的，我們這組整個學期只有一個人被抽到一次，然後有的人一堂課就一直被抽到(當然只能上台一次)，我都不知道是自己太雖，還是上帝真的不會擲骰子了。\n\n喔還有學期初說好會換座位，結果只有期中換了一次，我們從最後面坐到最前面，真的是連坐座位都被隱性霸凌。\n\n我是每個禮拜都有乖乖看影片，按照表訂進度去學習，但似乎也有不少人是完全都不看影片自己念，又或者有些人會一次寫很多週的檢驗題，然而這樣就會導致一個問題，就是有時候我做完檢驗題傳給批改的同學時，會發現批改的同學自己也還沒做完，所以說就必須等他做完後我才能通關，可是只有前十四位通關的可以加分，所以有時候會因此而錯過加分的機會。\n\n喔對還要抱怨一下，到底是是有多自戀才會每張投影片都放自己的照片，然後還要求我們印出來當作講義，超級浪費油墨，再加上沒什麼美感，很難想像ppt簡報課會是他開的...\n\n還有教授的廢文真的很多，比我高中同學還多，當初看到教授主動加我好友還蠻興奮的，現在想想，自己真的是太年輕了...\n\n有很多人批評的點是葉班考試成績往往都比謝班低很多，原因是benson(丙成)常常教得都太過簡單，不過這邊我想幫他平反一下，畢竟前面壞話寫夠多了，稍微寫點好話好了，我覺得在教學上老師還是有把該教的東西交給我們，像最後一堂課老師親自教我們推導binary hypothesis theory，的確教得很棒，但也讓我有種如果他不搞翻轉有多好的既視感，那究竟為何成績會差那麼多呢，我覺得很大的原因是：練習的題目的難度差異，謝班無論是預習作業還是共同作業，都比葉班的困難，這學期benson說他有把題目的難度提升一些，但很顯然還是不夠，再加上老師影片都是用淺顯易懂的例子將核心觀念教給我們，不會特別去push到特別刁鑽的情況或題目，所以雖然學習起來輕鬆快樂，動不動2倍速起跳，但是當考題出來的時候，就會覺得怎麼跟我學的機率不太一樣。這學期期中考的時候benson有出題，可以感受到不同於電機系正常必修課的容易，平均也是非常之高，甚至有人滿分，但是到期末輪到謝泓昀出題，考題又恢復了電機必修的水準，有很多題目都與從我們沒有寫的共同作業題目類似，雖然benson有一再強調要寫共同作業，那為什麼當初的檢驗題或in-class challenge不直接寫共同作業就好呢?我們花了大量時間，練習了大量題目，卻沒有得到相應的成績，很不是滋味呀!\n\n寫到這裡我也沒想到自己能黑那麼多東西，不過其實葉丙成老師在教學上給我的整體感覺還是不錯的，待人和善，有問必答，跟著老師學習會覺得機率是電機系最簡單的課，高中生都能懂，如果你真的覺得快樂學習>分數的話，那麼丙成班是不賴的選擇，畢竟修丙成的機率，我可是從來沒有想過要跳班，我其實也蠻喜歡看影片學習的方式，因為的確節省了我大量的時間，然後老師在最後一堂課分享的人生哲理雖然聽起來有些馬後炮，但我也確實有些收穫。這是一門怎麼樣的課，其實端看你從哪個角度去看，這就跟你如何看翻轉教育的道理是相同的。想嘗試不一樣的教學模式，換點口味，千萬不要因為我前面拉拉雜雜寫的小小抱怨文而打退堂鼓喔~~~","課程小卦3（您的修課心得）":null,"課程小卦4（您的修課心得）":null,"課程小卦5（您的修課心得）":null,"課程小卦6（您的修課心得）":null,"課程小卦7（您的修課心得）":null,"課程小卦8（您的修課心得）":null,"課程小卦9（您的修課心得）":null}]